Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Environment functions Reference
fr: Environment - Référence Fonctions

source: Writes an environment variable.
fr: Définit une variable d'environnement.

source: Refreshes the OS environment.
fr: Actualise l'environnement de l'OS.

source: Retrieves memory related information.
fr: Récupère des informations relatives à la mémoire.

source: Name of the environment variable to set.
fr: Nom de la variable d'environnement à définir

source: Value to set the environment variable to.
fr: Valeur à attribuer à la variable d'environnement.

source: If a value is not used the environment variable will be deleted.
fr: Si aucune valeur n'est utilisée, la variable d'environnement sera supprimée.

source: not 0.
fr: Retourne une valeur non nulle.

source: A environment variable set in this way will only be accessible to programs that AutoIt spawns (Run(), RunWait()).
fr: Une variable d'environnement définie de cette manière ne sera accessible qu'aux programmes engendrés par le script AutoIt (Run(), RunWait()).

source: Once AutoIt closes, the variables will cease to exist.
fr: Une fois le script terminé, les variables cesseront d'exister.

source: Create an environment variable called %MYVAR% and assign it a value.
fr: Crée une variable d'environnement appelée %MYVAR% et lui attribue une valeur.

source: Retrieve the environment variable that was just assigned a value previously.
fr: Récupére la variable d'environnement dont on vient d'attribuer une valeur auparavant.

source: Display the value of the environment variable $MYVAR%.
fr: Affiche la valeur de la variable d'environnement %MYVAR%.

source: none.
fr: Aucune valeur de retour.

source: Similar effect as logging off and then on again.
fr: Effet similaire à la déconnexion, puis reconnexion de la session.

source: For example, changes to the %path% environment might not take effect until you call EnvUpdate() (or you logoff/reboot).
fr: Par exemple, les modifications de la variable d'environnement %PATH% pourraient ne pas prendre effet tant que vous n'appelez EnvUpdate() (ou déconnecter la session/rebooter).

source: Retrieve the system environment variable called %PATH%.
fr: Récupére la variable d'environnement système appelé %PATH%.

source: Assign the system environment variable called %PATH% with its current value as well as the script directory.
fr: Assigne la variable d'environnement système appelé %PATH% avec sa valeur actuelle ainsi que le répertoire de script.

source: When you assign an environment variable you do so minus the percentage signs (%).
fr: Lorsque vous affectez une variable d'environnement, vous le faites moins les signes de pourcentage (%).

source: Refresh the OS environment for changes to take affect.
fr: Actualise l'environnement OS pour que les modifications prennent effet.

source: Retrieve the system environment variable that was just assigned a value previously.
fr: Récupére la variable d'environnement système dont on vient d'attribuer une valeur auparavant.

source: Display the value of the environment variable $PATH%.
fr: Affiche la valeur de la variable d'environnement %PATH%.

source: Return the value of the variable defined by a string.
fr: Retourne la valeur de la variable définie par une chaîne de caractère.

source: string representing name of the variable.
fr: Chaîne de caractères représentant la variable.

source: the value of the variable.
fr: Retourne la valeur de la variable.

source: "" (empty string) and sets the @error flag to non-zero.
fr: Retourne une chaîne vide et @error <> 0.

source: If there is a need to use Eval() to read a variable, then in most situations Assign() should be used to create/write to the variable and IsDeclared() should be used to check that the variable exists.
fr: Si l'utilisation de la fonction Eval() s'avère nécessaire pour lire une variable, dans la plupart des situations Assign() devrait être utilisé pour la créer ou l'écrire, et la fonction IsDeclared() devra être utilisée afin de vérifier qu'elle existe.

source: Initialize the variale $sString with data
fr: Initialise le variale $sChaine avec des données

source: EventLog user defined functions Reference
fr: EventLog - Référence

source: When using them you need to add a #include <EventLog.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <EventLog.au3>.

source: Excel user defined functions Reference
fr: Excel - Référence

source: When using them you need to add a #include <Excel.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <Excel.au3>.

source: Execute an expression.
fr: Exécute une expression.

source: string representing an expression to be evaluated.
fr: Chaîne de caractères représentant l'expression à calculer.

source: the value of the evaluated expression.
fr: Retourne la valeur de l'expression évaluée.

source: $v is set to 2
fr: $v est réglé sur 2

source: Calculates e to the power of a number.
fr: Calcule e à la puissance d'un nombre.

source: Returns e raised to the power of expression.
fr: Retourne e à la puissance expression.

source: e is the base of the natural logarithm and is approximately 2.71828182845905
fr: e est la base du logarithme naturel et vaut approximativement 2,71828182845905

source: Assign a Local variable the Euler's number of 5.
fr: Assigne une variable locale avec l'exponentielle de 5.

source: File user defined functions Reference
fr: File - Référence

source: When using them you need to add a #include <File.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <File.au3>.

source: Changes the current working directory.
fr: Change le répertoire de travail actuel.

source: The path to make the current working directory.
fr: Le chemin d'accès au nouveau répertoire de travail.

source: 0 if working directory not changed.
fr: Retourne 0 si le répertoire de travail n'est pas modifié.

source: Display the current working directory.
fr: Affiche le répertoire de travail courant.

source: Set the working directory @WorkingDir to the @WindowsDir directory.
fr: Définit le répertoire de travail WorkingDir dans le répertoire WindowsDir.

source: This is normally C:\Windows.
fr: C'est normalement C:\Windows.

source: Display the working directory after setting it to the windows directory.
fr: Affiche le répertoire de travail après l'avoir mis dans le répertoire Windows.

source: Closes a previously opened file.
fr: Ferme un fichier texte précédemment ouvert.

source: The handle of a file, as returned by a previous call to FileOpen().
fr: Le handle d'un fichier, renvoyé par un précédent appel à FileOpen().

source: 0 if the filehandle is invalid.
fr: Retourne 0 si le handle du fichier n'est pas valide.

source: Upon termination, AutoIt automatically closes any files it opened, but calling FileClose() is still a good idea.
fr: A la fermeture du script, AutoIt ferme automatiquement tous les fichiers qu'il a ouvert, mais appeler FileClose() est néanmoins une bonne idée.

source: This function is also used to close search handles as returned by FileFindFirstFile().
fr: Cette fonction est aussi utilisée pour fermer les handles de recherche renvoyés par FileFindFirstFile().

source: Create a constant variable in Local scope of the filepath that will be read/written to.
fr: Créez une constante de portée locale du chemin du fichier qui sera lu/écrit.

source: Create a temporary file to read data from.
fr: Crée un fichier temporaire pour lire les données.

source: Open the file for reading and store the handle to a variable.
fr: Ouvre le fichier pour la lecture et stocke le handle dans une variable.

source: Read the contents of the file using the handle returned by FileOpen.
fr: Lit le contenu du fichier à l'aide du handle retournée par FileOpen.

source: Close the handle returned by FileOpen.
fr: Ferme le handle renvoyé par FileOpen.

source: Display the contents of the file.
fr: Affiche le contenu du fichier.

source: Delete the temporary file.
fr: Supprime le fichier temporaire.

source: Create a file.
fr: Crée un fichier.

source: Create a variable to store a boolean value.
fr: Crée une variable pour stocker une valeur booléenne.

source: If FileWrite returned 1 this will be True otherwise False.
fr: Si FileWrite retourné 1 ce sera vrai False sinon.

source: Return the boolean value of either True of False, depending on the return value of FileWrite.
fr: Retourne la valeur booléenne soit Vrai ou faux, en fonction de la valeur de retour de FileWrite.

source: Copies one or more files.
fr: Copie un ou plusieurs fichiers.

source: The source path of the file(s) to copy.(* and ?
fr: Chemin du répertoire contenant le(s) fichier(s) à copier.

source: wildcards accepted - See Remarks)
fr: Les Wildcards sont pris en charge.

source: The destination path of the copied file(s).
fr: Chemin du répertoire de destination du/des fichier(s) copié(s).

source: this flag determines whether to overwrite files if they already exist.
fr: ce paramètre détermine s'il faut écraser les fichiers existants.

source: $FC_CREATEPATH (8) = Create destination directory structure if it doesn't exist (See Remarks).
fr: $FC_CREATEPATH (8) = Crée la structure du répertoire de destination, si elle n'existe pas (Voir Remarques).

source: See FileFindFirstFile() for a discussion about wildcards.
fr: Consultez FileFindFirstFile pour des précisions sur les 'wildcards'.

source: The destination directory must already exist, except using with flag value $FC_CREATEPATH (8).
fr: Le répertoire de destination doit exister, sauf si le paramètre $FC_CREATEPATH (8) est utilisé.

source: For instance the combined flag $FC_OVERWRITE (1) + $FC_CREATEPATH (8) overwrites the target file and pre-checks for the destination directory structure and if it doesn't exist creates it automatically.
fr: Par exemple le paramètre combiné $FC_OVERWRITE (1) + $FC_CREATEPATH (8), écrase le fichier cible et vérifie la structure du répertoire de destination et si elle n'existe pas, il la crée automatiquement.

source: Some file attributes can make the overwriting impossible, if this is the case look at FileSetAttrib() to change the attributes of a file.
fr: Certains attributs de fichier peuvent rendre l'écrasement impossible, si c'est le cas consultez FileSetAttrib() .

source: Create a temporary file to copy.
fr: Crée un fichier temporaire pour copier.

source: Copy Au3 files in the temporary directory to a new folder/directory called Au3Files.
fr: Copie les fichiers Au3 dans le répertoire temporaire vers un nouveau dossier/répertoire appelé Au3Files.

source: Display the temporary directory.
fr: Affiche le répertoire temporaire.

source: Creates an NTFS hardlink to a file or a directory.
fr: Crée un lien dur NTFS vers un fichier ou un répertoire.

source: Path of the source to which the hardlink will be created.
fr: Chemin de la source à laquelle le hardlink sera créé.

source: Path of the hardlink.
fr: Chemin du lien dur.

source: this flag determines whether to overwrite link if they already exist.
fr: cet indicateur détermine s'il faut remplacer un lien s'il existe déjà.

source: 0 = (default) do not overwrite existing link
fr: 0 = (par défaut) de ne pas écraser lien existant

source: 1 = overwrite existing link
fr: 1 = écraser le lien existant

source: The destination directory must already exist.
fr: Le répertoire de destination doit déjà exister.

source: This function works only on volumes with the NTFS File system.
fr: Cette fonction ne fonctionne que sur un volume avec un système de fichiers NTFS.

source: If the source is a file, the hardlink must be on the same volume.
fr: Si la source est un fichier, le lien dur doit être sur le même volume.

source: If the source is a directory cross volume is allowed.
fr: Si la source est un répertoire, le cross volume est autorisé.

source: FileDelete() or FileMove() can be used on hardlink.
fr: FileDelete() ou FileMove() peut être utilisée sur un 'hardlink'.

source: To manage the link with the explorer you can use the shell extension NTFSLink
fr: Pour gérer le lien avec l'explorateur, vous pouvez utiliser l'extension du shell NTFSLink

source: Create a temporary file to link to.
fr: Crée un fichier temporaire pour le relier.

source: Create a NTFS link of the .txt file to the .log file on the desktop.
fr: Crée un lien NTFS du fichier .txt au fichier .log du bureau.

source: Display a message of whether the NTFS link was created.
fr: Affiche un message si le lien NTFS a été créé.

source: Open the desktop directory.
fr: Ouvre le dossier du bureau.

source: Delete the temporary files.
fr: Supprime les fichiers temporaires.

source: Creates a shortcut (.lnk) to a file.
fr: Crée un raccourci (.lnk) vers un fichier.

source: Full path and file name of file to which the shortcut will point.
fr: Nom et chemin complet du fichier sur lequel pointera le raccourci.

source: Full path and file name of the shortcut.
fr: Nom et chemin complet du raccourci.

source: Working directory.
fr: Répertoire de travail.

source: Additional file arguments.
fr: Arguments additionnels du fichier.

source: File Description.
fr: Description du fichier

source: Full Path/File name of icon to use.
fr: Nom et chemin complet de l'icône à utiliser.

source: Hotkey - same as the Send() key format.
fr: Touche de raccourci - même format de touche que pour la fonction Send()

source: The icon instance to use (usually 0)
fr: Instance de l'icône à utiliser (généralement 0).

source: The state the shortcut is launched in.
fr: L'état dans lequel le programme est lancé.

source: Use either @SW_SHOWNORMAL, @SW_SHOWMINNOACTIVE or @SW_SHOWMAXIMIZED
fr: Utilisez @SW_SHOWNORMAL, @SW_SHOWMINNOACTIVE ou @SW_SHOWMAXIMIZED

source: 0 if lnk cannot be created.
fr: Retourne 0 si le raccourci n'a pu être créé.

source: Hotkeys for windows shortcuts are of the following form:
fr: Les raccourcis clavier sous Windows sont de la forme :

source: Ctrl+Alt+X, Ctrl+Shift+X, Shift+Alt+X, Ctrl+NumPadKey, or Alt+NumPadKey where X represents a letter, number, punctuation, or function key.
fr: Ctrl+Alt+X, Ctrl+Shift+X, Shift+Alt+X, Ctrl+NumPadKey, ou Alt+NumPadKey où X représente une lettre, un nombre, une ponctuation, ou une touche de fonction.

source: If you specify an invalid form, Windows typically defaults to Ctrl+Alt
fr: Si vous spécifiez une forme invalide, Windows utilisera Ctrl+Alt par défaut

source: Note that Windows distinguishes number pad keys from regular number and punctuation keys.
fr: Notez que Windows distingue les chiffres du pavé numérique des chiffres standards ainsi que les touches de ponctuation.

source: FileCreateShortcut() allows you to create Ctrl+X and Alt+X shortcuts (which Windows normally only allows when X is a NumPadKey); however, you should avoid these assignments as they may conflict with standard application hotkeys.
fr: FileCreateShortcut() vous autorise à créer des raccourcis clavier Ctrl+X et Alt+X (alors que Windows n'autorise X que s'il est un chiffre du pavé numérique); cependant, vous devriez éviter ce genre d'assignation, car il pourrait entrer en conflit avec des raccourcis clavier standards.

source: Windows prohibits ESC, ENTER, TAB, SPACEBAR, PRINT SCREEN, SHIFT, or BACKSPACE from being used in hotkeys.
fr: Windows interdit l'utilisation de ESC, ENTER, TAB, SPACEBAR, PRINT SCREEN, SHIFT, ou BACKSPACE dans les raccourcis clavier.

source: FileCreateShortcut() does not require a valid target, workdir, icon, or hotkey in order to "successfully" create the LNK file; however, the destination of the LNK file must be valid!
fr: FileCreateShortcut() ne requiert pas une cible valide, le répertoire de travail, l'icône, ou le raccourci clavier crée avec succès un fichier LNK; Cependant, le chemin complet vers le raccourci doit d'être valide !

source: If the hotkey you choose is already in use, your new shortcut takes precedence.
fr: Si le raccourci clavier choisit existe déjà, votre nouveau raccourci aura la priorité.

source: Also, if you create a shortcut with the same path\name as as a pre-existing shortcut, it gets overwritten with your new version.
fr: De plus, si vous créez un raccourci avec le même chemin/nom qu'un raccourci précédent, ce dernier sera remplacé par votre nouvelle version.

source: Create a constant variable in Local scope of the shortcut filepath.
fr: Crée une constante de portée locale du chemin du fichier de raccourci.

source: Create a shortcut on the desktop to explorer.exe and set the hotkey combination Ctrl+Alt+T or in AutoIt ^!t to the shortcut.
fr: Crée un raccourci sur le bureau pour explorer.exe et définit la combinaison de touches Ctrl + Alt + T ou en AutoIt ^!T au raccourci.

source: Retrieve details about the shortcut.
fr: Consulte les détails sur le raccourci.

source: Delete the shortcut.
fr: Supprime le raccourci.

source: Delete one or more files.
fr: Supprime un ou plusieurs fichiers.

source: The path of the file(s) to delete.(* and ?
fr: Chemin du répertoire contenant le(s) fichier(s) à supprimer.

source: 0 if files are not deleted or do not exist.
fr: Retourne 0 si le ou les fichiers n'ont pas étés supprimés ou s'ils n'existent pas.

source: If the "path" passed to FileDelete() is a folder, the files therein will be deleted just as if you had used the *.* mask.
fr: Si le "chemin" transmis à FileDelete() est un dossier, les fichiers qui y sont, seront supprimés comme si vous aviez utilisé le masque *.*.

source: Some file attributes can make the deletion impossible, if this is the case look at FileSetAttrib() to change the attributes of a file.
fr: Certains attributs de fichier peuvent rendre la suppression impossible, si c'est le cas consultez FileSetAttrib() pour changer les attributs d'un fichier.

source: Display the contents of the file passing the filepath to FileRead instead of a handle returned by FileOpen.
fr: Affiche le contenu du fichier en passant le chemin du fichier à FILEREAD au lieu d'un handle retournée par FileOpen.

source: Display a message of whether the file was deleted.
fr: Affiche un message si le fichier a été supprimé.

source: File, Directory and Disk functions Reference
fr: File, Directory and Disk - Référence Fonctions

source: Checks if a file or directory exists.
fr: Vérifie si un fichier ou un dossier existe.

source: Creates a search handle, defined by a path and file mask.
fr: Retourne un "handle" de recherche, selon la chaîne de caractères de recherche de fichiers.

source: Returns the next filename defined by the search handle.
fr: Retourne un nom de fichier en fonction d'un précédent appel à FileFindFirstFile.

source: Flushes the file's buffer to disk.
fr: Vide la mémoire tampon du fichier sur le disque.

source: Returns a code string representing a file's attributes.
fr: Retourne une chaîne de code représentant les attributs d'un fichier.

source: Determines the text encoding used in a file.
fr: Détermine l'encodage du texte utilisé dans un fichier.

source: Returns the long path+name of the path+name passed.
fr: Retourne le chemin+nom long du chemin+nom donné.

source: Retrieves the current file position.
fr: Retrouve la position dans le fichier courant.

source: Retrieves details about a shortcut.
fr: Retrouve les détails d'un raccourci.

source: Returns the 8.3 short path+name of the path+name passed.
fr: Retourne le chemin+nom au format court 8.3 du chemin+nom donné.

source: Returns the size of a file in bytes.
fr: Retourne la taille d'un fichier en octets.

source: Returns the time and date information for a file.
fr: Retourne les informations de date et heure d'un fichier.

source: Returns the "File" version information.
fr: Retourne les informations de version d'un Fichier.

source: Include and install a file with the compiled script.
fr: Inclut et installe un fichier avec le script compilé.

source: Moves one or more files.
fr: Déplace un ou plusieurs fichiers.

source: Opens a file for reading or writing.
fr: Ouvre un fichier texte pour lecture ou écriture.

source: Initiates a Open File Dialog.
fr: Ouvre un dialogue permettant à l'utilisateur de choisir un fichier.

source: Read in a number of characters from a previously opened file.
fr: Lit un nombre donné de caractères dans un fichier texte précédemment ouvert.

source: Read in a line of text from a previously opened text file.
fr: Lit une ligne de texte dans un fichier texte précédemment ouvert.

source: Reads the specified file into an array.
fr: Lit le fichier spécifié et construit un tableau avec les lignes.

source: Sends a file or directory to the recycle bin.
fr: Envoie un fichier ou un répertoire à la corbeille.

source: Empties the recycle bin.
fr: Vide la corbeille.

source: Initiates a Save File Dialog.
fr: Ouvre un dialogue permettant à l'utilisateur d'enregistrer un fichier.

source: Initiates a Browse For Folder dialog.
fr: Lance une boîte de dialogue pour choisir un dossier.

source: Sets the attributes of one or more files/directories.
fr: Définit les attributs d'un ou plusieurs fichiers.

source: Sets the current file position.
fr: Définit la position actuelle dans un fichier.

source: Sets the timestamp of one of more files.
fr: Attribue le timestamp (l'horodatage) d'un ou plusieurs fichiers/dossiers.

source: Write text/data to the end of a previously opened file.
fr: Ajoute un texte/des données à la fin d'un fichier précédemment ouvert.

source: Append a line of text to the end of a previously opened text file.
fr: Ajoute une ligne de texte à la fin d'un fichier texte précédemment ouvert.

source: Deletes a value from a standard format .ini file.
fr: Supprime une valeur à partir d'un fichier .ini au format standard.

source: Reads a value from a standard format .ini file.
fr: Lit une valeur d'un fichier .ini de format standard.

source: Reads all key/value pairs from a section in a standard format .ini file.
fr: Lit toutes les paires clé/valeur d'une section d'un fichier .ini au format standard.

source: Reads all sections in a standard format .ini file.
fr: Lit toutes les sections dans un fichier .ini de format standard.

source: Renames a section in a standard format .ini file.
fr: Renomme une section dans un fichier ini de format standard.

source: Writes a value to a standard format .ini file.
fr: Écrit une valeur dans un fichier ini de format standard.

source: Writes a section to a standard format .ini file.
fr: Écrit une section dans un fichier ini de format standard.

source: The directory or file to check.
fr: Chemin du répertoire ou du fichier à vérifier.

source: 0 if path/file does not exist.
fr: Retourne 0 si le fichier ou le répertoire n'existe pas.

source: FileExists() returns 0 if you specify a floppy drive which does not contain a disk.
fr: FileExists() retourne 0 si vous spécifiez un lecteur qui ne contient pas de média.

source: Create a temporary file to determine if it exists.
fr: Crée un fichier temporaire afin de déterminer s'il existe.

source: Display a message of whether the file exists or not.
fr: Affiche un message si le fichier existe ou pas.

source: True if the buffer was flushed (or did not need to be flushed).
fr: Retourne True si la mémoire tampon (buffer) a été vidée (ou n'a pas besoin d'être vidée).

source: A file is flushed when its handle is closed or when Windows internal buffer is full.
fr: Le buffer d'un fichier est vidé lorsqu'il est fermé ou lorsque le buffer interne de Windows est plein.

source: This function forces an immediate flushing of the buffer.
fr: Cette fonction force un vidage immédiat du buffer.

source: This function can only be used with file handles returned from FileOpen().
fr: Cette fonction ne peut être utilisée qu'avec les handles de fichiers retournés par FileOpen().

source: Open the file for writing (overwrite the file) and store the handle to a variable.
fr: Ouvre le fichier en écriture (écrase le fichier) et stocke Le handle dans une variable.
